[
    {
        "Tool Name": "Mimikatz",
        "Description": "[Mimikatz](https://attack.mitre.org/software/S0002) is a credential dumper capable of obtaining plaintext Windows account logins and passwords, along with many other features that make it useful for testing the security of networks. (Citation: Deply Mimikatz) (Citation: Adsecurity Mimikatz Guide)",
        "Relationship ID": "relationship--30c4bdc2-1697-4eb6-ac74-3cfb86d17a5b",
        "Relationship Type": "uses"
    },
    {
        "Tool Name": "PsExec",
        "Description": "[PsExec](https://attack.mitre.org/software/S0029) is a free Microsoft tool that can be used to execute a program on another computer. It is used by IT administrators and attackers.(Citation: Russinovich Sysinternals)(Citation: SANS PsExec)",
        "Relationship ID": "relationship--4d1f00f6-30cc-48b6-baef-66a7fe3cbe86",
        "Relationship Type": "uses"
    },
    {
        "Tool Name": "Net",
        "Description": "The [Net](https://attack.mitre.org/software/S0039) utility is a component of the Windows operating system. It is used in command-line operations for control of users, groups, services, and network connections. (Citation: Microsoft Net Utility)\n\n[Net](https://attack.mitre.org/software/S0039) has a great deal of functionality, (Citation: Savill 1999) much of which is useful for an adversary, such as gathering system and network information for Discovery, moving laterally through [SMB/Windows Admin Shares](https://attack.mitre.org/techniques/T1021/002) using <code>net use</code> commands, and interacting with services. The net1.exe utility is executed for certain functionality when net.exe is run and can be used directly in commands such as <code>net1 user</code>.",
        "Relationship ID": "relationship--d993160c-17cd-4026-996a-f7c9bb5b5fc7",
        "Relationship Type": "uses"
    },
    {
        "Tool Name": "Impacket",
        "Description": "[Impacket](https://attack.mitre.org/software/S0357) is an open source collection of modules written in Python for programmatically constructing and manipulating network protocols. [Impacket](https://attack.mitre.org/software/S0357) contains several tools for remote service execution, Kerberos manipulation, Windows credential dumping, packet sniffing, and relay attacks.(Citation: Impacket Tools)",
        "Relationship ID": "relationship--e4c6b2e0-e644-4bb6-b2d0-f5a757ed9485",
        "Relationship Type": "uses"
    },
    {
        "Tool Name": "Invoke-PSImage",
        "Description": "[Invoke-PSImage](https://attack.mitre.org/software/S0231) takes a PowerShell script and embeds the bytes of the script into the pixels of a PNG image. It generates a one liner for executing either from a file of from the web. Example of usage is embedding the PowerShell code from the Invoke-Mimikatz module and embed it into an image file. By calling the image file from a macro for example, the macro will download the picture and execute the PowerShell code, which in this case will dump the passwords. (Citation: GitHub Invoke-PSImage)",
        "Relationship ID": "relationship--e7e5e5af-7ef8-43a4-88c6-8f142ee3e1c9",
        "Relationship Type": "uses"
    }
]